; domain
(define (domain emergency)
  (:requirements :strips :typing)

  (:types
    drone
    person
    crate
    location
    content
    arm
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)

    (arm-of ?a - arm ?d - drone)
    (free ?a - arm)
    (holding ?a - arm ?c - crate)

    (crate-has ?c - crate ?t - content)
    (person-has ?p - person ?t - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and
      (not (at-drone ?d ?from))
      (at-drone ?d ?to)
    )
  )

  (:action pick-up
    :parameters (?d - drone ?a - arm ?c - crate ?l - location)
    :precondition (and
      (at-drone ?d ?l)
      (at-crate ?c ?l)
      (arm-of ?a ?d)
      (free ?a)
    )
    :effect (and
      (not (at-crate ?c ?l))
      (not (free ?a))
      (holding ?a ?c)
    )
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - crate ?p - person ?l - location ?t - content)
    :precondition (and
      (at-drone ?d ?l)
      (at-person ?p ?l)
      (arm-of ?a ?d)
      (holding ?a ?c)
      (crate-has ?c ?t)
    )
    :effect (and
      (person-has ?p ?t)
      (free ?a)
      (not (holding ?a ?c))
    )
  )

)

; problem
(define (problem emergency_d1_l20_p20_c20_g20)
(:domain emergency)
(:objects
	drone1 - drone
	drone1_arm1 - arm
	drone1_arm2 - arm
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
)
(:init
	(at-drone drone1 depot)
	(arm-of drone1_arm1 drone1)
	(arm-of drone1_arm2 drone1)
	(free drone1_arm1)
	(free drone1_arm2)
	(at-crate crate1 depot)
	(at-crate crate2 depot)
	(at-crate crate3 depot)
	(at-crate crate4 depot)
	(at-crate crate5 depot)
	(at-crate crate6 depot)
	(at-crate crate7 depot)
	(at-crate crate8 depot)
	(at-crate crate9 depot)
	(at-crate crate10 depot)
	(at-crate crate11 depot)
	(at-crate crate12 depot)
	(at-crate crate13 depot)
	(at-crate crate14 depot)
	(at-crate crate15 depot)
	(at-crate crate16 depot)
	(at-crate crate17 depot)
	(at-crate crate18 depot)
	(at-crate crate19 depot)
	(at-crate crate20 depot)
	(crate-has crate1 food)
	(crate-has crate2 food)
	(crate-has crate3 food)
	(crate-has crate4 food)
	(crate-has crate5 food)
	(crate-has crate6 food)
	(crate-has crate7 food)
	(crate-has crate8 food)
	(crate-has crate9 food)
	(crate-has crate10 food)
	(crate-has crate11 food)
	(crate-has crate12 food)
	(crate-has crate13 food)
	(crate-has crate14 food)
	(crate-has crate15 food)
	(crate-has crate16 food)
	(crate-has crate17 medicine)
	(crate-has crate18 medicine)
	(crate-has crate19 medicine)
	(crate-has crate20 medicine)
	(at-person person1 loc7)
	(at-person person2 loc12)
	(at-person person3 loc13)
	(at-person person4 loc6)
	(at-person person5 loc20)
	(at-person person6 loc9)
	(at-person person7 loc9)
	(at-person person8 loc19)
	(at-person person9 loc18)
	(at-person person10 loc8)
	(at-person person11 loc13)
	(at-person person12 loc10)
	(at-person person13 loc4)
	(at-person person14 loc5)
	(at-person person15 loc3)
	(at-person person16 loc3)
	(at-person person17 loc1)
	(at-person person18 loc19)
	(at-person person19 loc4)
	(at-person person20 loc5)
)
(:goal (and
	(at-drone drone1 depot)
	(person-has person1 food)
	(person-has person1 medicine)
	(person-has person2 food)
	(person-has person2 medicine)
	(person-has person3 food)
	(person-has person4 food)
	(person-has person5 food)
	(person-has person6 food)
	(person-has person7 food)
	(person-has person8 food)
	(person-has person9 food)
	(person-has person9 medicine)
	(person-has person10 food)
	(person-has person12 food)
	(person-has person12 medicine)
	(person-has person13 food)
	(person-has person14 food)
	(person-has person15 food)
	(person-has person16 food)
	(person-has person20 food)
))
)

; plan
1. (pick-up drone1 drone1_arm1 crate20 depot)
   deleted: (at-crate crate20 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate20)
   goals met: 1 of 21
2. (pick-up drone1 drone1_arm2 crate16 depot)
   deleted: (at-crate crate16 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate16)
   goals met: 1 of 21
3. (fly drone1 depot loc20)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc20)
   goals met: 0 of 21
4. (deliver drone1 drone1_arm2 crate16 person5 loc20 food)
   deleted: (holding drone1_arm2 crate16)
   added: (person-has person5 food) (free drone1_arm2)
   goals met: 1 of 21
5. (fly drone1 loc20 depot)
   deleted: (at-drone drone1 loc20)
   added: (at-drone drone1 depot)
   goals met: 2 of 21
6. (pick-up drone1 drone1_arm2 crate15 depot)
   deleted: (at-crate crate15 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate15)
   goals met: 2 of 21
7. (fly drone1 depot loc19)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc19)
   goals met: 1 of 21
8. (deliver drone1 drone1_arm2 crate15 person8 loc19 food)
   deleted: (holding drone1_arm2 crate15)
   added: (person-has person8 food) (free drone1_arm2)
   goals met: 2 of 21
9. (fly drone1 loc19 depot)
   deleted: (at-drone drone1 loc19)
   added: (at-drone drone1 depot)
   goals met: 3 of 21
10. (pick-up drone1 drone1_arm2 crate14 depot)
   deleted: (at-crate crate14 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate14)
   goals met: 3 of 21
11. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 2 of 21
12. (deliver drone1 drone1_arm2 crate14 person3 loc13 food)
   deleted: (holding drone1_arm2 crate14)
   added: (person-has person3 food) (free drone1_arm2)
   goals met: 3 of 21
13. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 4 of 21
14. (pick-up drone1 drone1_arm2 crate13 depot)
   deleted: (at-crate crate13 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate13)
   goals met: 4 of 21
15. (fly drone1 depot loc8)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc8)
   goals met: 3 of 21
16. (deliver drone1 drone1_arm2 crate13 person10 loc8 food)
   deleted: (holding drone1_arm2 crate13)
   added: (person-has person10 food) (free drone1_arm2)
   goals met: 4 of 21
17. (fly drone1 loc8 depot)
   deleted: (at-drone drone1 loc8)
   added: (at-drone drone1 depot)
   goals met: 5 of 21
18. (pick-up drone1 drone1_arm2 crate12 depot)
   deleted: (at-crate crate12 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate12)
   goals met: 5 of 21
19. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 4 of 21
20. (deliver drone1 drone1_arm2 crate12 person4 loc6 food)
   deleted: (holding drone1_arm2 crate12)
   added: (person-has person4 food) (free drone1_arm2)
   goals met: 5 of 21
21. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 6 of 21
22. (pick-up drone1 drone1_arm2 crate11 depot)
   deleted: (at-crate crate11 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate11)
   goals met: 6 of 21
23. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 5 of 21
24. (deliver drone1 drone1_arm2 crate11 person13 loc4 food)
   deleted: (holding drone1_arm2 crate11)
   added: (person-has person13 food) (free drone1_arm2)
   goals met: 6 of 21
25. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 7 of 21
26. (pick-up drone1 drone1_arm2 crate10 depot)
   deleted: (at-crate crate10 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate10)
   goals met: 7 of 21
27. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 6 of 21
28. (deliver drone1 drone1_arm2 crate10 person9 loc18 food)
   deleted: (holding drone1_arm2 crate10)
   added: (person-has person9 food) (free drone1_arm2)
   goals met: 7 of 21
29. (deliver drone1 drone1_arm1 crate20 person9 loc18 medicine)
   deleted: (holding drone1_arm1 crate20)
   added: (person-has person9 medicine) (free drone1_arm1)
   goals met: 8 of 21
30. (fly drone1 loc18 depot)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 depot)
   goals met: 9 of 21
31. (pick-up drone1 drone1_arm1 crate19 depot)
   deleted: (at-crate crate19 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate19)
   goals met: 9 of 21
32. (pick-up drone1 drone1_arm2 crate9 depot)
   deleted: (at-crate crate9 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate9)
   goals met: 9 of 21
33. (fly drone1 depot loc12)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc12)
   goals met: 8 of 21
34. (deliver drone1 drone1_arm2 crate9 person2 loc12 food)
   deleted: (holding drone1_arm2 crate9)
   added: (person-has person2 food) (free drone1_arm2)
   goals met: 9 of 21
35. (deliver drone1 drone1_arm1 crate19 person2 loc12 medicine)
   deleted: (holding drone1_arm1 crate19)
   added: (person-has person2 medicine) (free drone1_arm1)
   goals met: 10 of 21
36. (fly drone1 loc12 depot)
   deleted: (at-drone drone1 loc12)
   added: (at-drone drone1 depot)
   goals met: 11 of 21
37. (pick-up drone1 drone1_arm1 crate18 depot)
   deleted: (at-crate crate18 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate18)
   goals met: 11 of 21
38. (pick-up drone1 drone1_arm2 crate8 depot)
   deleted: (at-crate crate8 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate8)
   goals met: 11 of 21
39. (fly drone1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 10 of 21
40. (deliver drone1 drone1_arm2 crate8 person12 loc10 food)
   deleted: (holding drone1_arm2 crate8)
   added: (person-has person12 food) (free drone1_arm2)
   goals met: 11 of 21
41. (deliver drone1 drone1_arm1 crate18 person12 loc10 medicine)
   deleted: (holding drone1_arm1 crate18)
   added: (person-has person12 medicine) (free drone1_arm1)
   goals met: 12 of 21
42. (fly drone1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 13 of 21
43. (pick-up drone1 drone1_arm1 crate17 depot)
   deleted: (at-crate crate17 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate17)
   goals met: 13 of 21
44. (pick-up drone1 drone1_arm2 crate7 depot)
   deleted: (at-crate crate7 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate7)
   goals met: 13 of 21
45. (fly drone1 depot loc7)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc7)
   goals met: 12 of 21
46. (deliver drone1 drone1_arm1 crate17 person1 loc7 medicine)
   deleted: (holding drone1_arm1 crate17)
   added: (person-has person1 medicine) (free drone1_arm1)
   goals met: 13 of 21
47. (deliver drone1 drone1_arm2 crate7 person1 loc7 food)
   deleted: (holding drone1_arm2 crate7)
   added: (person-has person1 food) (free drone1_arm2)
   goals met: 14 of 21
48. (fly drone1 loc7 depot)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 depot)
   goals met: 15 of 21
49. (pick-up drone1 drone1_arm1 crate6 depot)
   deleted: (at-crate crate6 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate6)
   goals met: 15 of 21
50. (pick-up drone1 drone1_arm2 crate5 depot)
   deleted: (at-crate crate5 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate5)
   goals met: 15 of 21
51. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 14 of 21
52. (deliver drone1 drone1_arm2 crate5 person6 loc9 food)
   deleted: (holding drone1_arm2 crate5)
   added: (person-has person6 food) (free drone1_arm2)
   goals met: 15 of 21
53. (deliver drone1 drone1_arm1 crate6 person7 loc9 food)
   deleted: (holding drone1_arm1 crate6)
   added: (person-has person7 food) (free drone1_arm1)
   goals met: 16 of 21
54. (fly drone1 loc9 depot)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 depot)
   goals met: 17 of 21
55. (pick-up drone1 drone1_arm1 crate4 depot)
   deleted: (at-crate crate4 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate4)
   goals met: 17 of 21
56. (pick-up drone1 drone1_arm2 crate3 depot)
   deleted: (at-crate crate3 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate3)
   goals met: 17 of 21
57. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 16 of 21
58. (deliver drone1 drone1_arm2 crate3 person14 loc5 food)
   deleted: (holding drone1_arm2 crate3)
   added: (person-has person14 food) (free drone1_arm2)
   goals met: 17 of 21
59. (deliver drone1 drone1_arm1 crate4 person20 loc5 food)
   deleted: (holding drone1_arm1 crate4)
   added: (person-has person20 food) (free drone1_arm1)
   goals met: 18 of 21
60. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 19 of 21
61. (pick-up drone1 drone1_arm1 crate2 depot)
   deleted: (at-crate crate2 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate2)
   goals met: 19 of 21
62. (pick-up drone1 drone1_arm2 crate1 depot)
   deleted: (at-crate crate1 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate1)
   goals met: 19 of 21
63. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 18 of 21
64. (deliver drone1 drone1_arm2 crate1 person15 loc3 food)
   deleted: (holding drone1_arm2 crate1)
   added: (person-has person15 food) (free drone1_arm2)
   goals met: 19 of 21
65. (deliver drone1 drone1_arm1 crate2 person16 loc3 food)
   deleted: (holding drone1_arm1 crate2)
   added: (person-has person16 food) (free drone1_arm1)
   goals met: 20 of 21
66. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 21 of 21
